wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/adc_reg.h
#define ADC_ADSR0_OVF_Pos               (3)                                         /*!< ADC_T::ADSR0: OVF Position             */
#define ADC_ADSR0_OVF_Msk               (0x1ul << ADC_ADSR0_OVF_Pos)                /*!< ADC_T::ADSR0: OVF Mask                 */

#define ADC_ADSR0_BUSY_Pos              (7)                                         /*!< ADC_T::ADSR0: BUSY Position            */
#define ADC_ADSR0_BUSY_Msk              (0x1ul << ADC_ADSR0_BUSY_Pos)               /*!< ADC_T::ADSR0: BUSY Mask                */

#define ADC_ADSR0_VALIDF_Pos            (8)                                         /*!< ADC_T::ADSR0: VALIDF Position          */
#define ADC_ADSR0_VALIDF_Msk            (0x1ul << ADC_ADSR0_VALIDF_Pos)             /*!< ADC_T::ADSR0: VALIDF Mask              */

#define ADC_ADSR0_OVERRUNF_Pos          (16)                                        /*!< ADC_T::ADSR0: OVERRUNF Position        */
#define ADC_ADSR0_OVERRUNF_Msk          (0x1ul << ADC_ADSR0_OVERRUNF_Pos)           /*!< ADC_T::ADSR0: OVERRUNF Mask            */

#define ADC_ADSR0_ADCINIT_Pos           (24)                                        /*!< ADC_T::ADSR0: ADCINIT Position         */
#define ADC_ADSR0_ADCINIT_Msk           (0x1ul << ADC_ADSR0_ADCINIT_Pos)            /*!< ADC_T::ADSR0: ADCINIT Mask             */

#define ADC_ADSR0_CHANNEL_Pos           (27)                                        /*!< ADC_T::ADSR0: CHANNEL Position         */
#define ADC_ADSR0_CHANNEL_Msk           (0x1ful << ADC_ADSR0_CHANNEL_Pos)           /*!< ADC_T::ADSR0: CHANNEL Mask             */

#define ADC_ADSR1_VALID_Pos             (0)                                         /*!< ADC_T::ADSR1: VALID Position           */
#define ADC_ADSR1_VALID_Msk             (0xfffffffful << ADC_ADSR1_VALID_Pos)       /*!< ADC_T::ADSR1: VALID Mask               */

#define ADC_ADSR2_OVERRUN_Pos           (0)                                         /*!< ADC_T::ADSR2: OVERRUN Position         */
#define ADC_ADSR2_OVERRUN_Msk           (0xfffffffful << ADC_ADSR2_OVERRUN_Pos)     /*!< ADC_T::ADSR2: OVERRUN Mask             */

#define ADC_ESMPCTL_EXTSMPT_Pos         (0)                                         /*!< ADC_T::ESMPCTL: EXTSMPT Position       */
#define ADC_ESMPCTL_EXTSMPT_Msk         (0x3ffful << ADC_ESMPCTL_EXTSMPT_Pos)       /*!< ADC_T::ESMPCTL: EXTSMPT Mask           */

#define ADC_CFDCTL_OVPEN_Pos            (0)                                         /*!< ADC_T::CFDCTL: OVPEN Position          */
#define ADC_CFDCTL_OVPEN_Msk            (0x1ul << ADC_CFDCTL_OVPEN_Pos)             /*!< ADC_T::CFDCTL: OVPEN Mask              */

#define ADC_ADPDMA_CURDAT_Pos           (0)                                         /*!< ADC_T::ADPDMA: CURDAT Position         */
#define ADC_ADPDMA_CURDAT_Msk           (0x3fffful << ADC_ADPDMA_CURDAT_Pos)        /*!< ADC_T::ADPDMA: CURDAT Mask             */

/**@}*/ /* ADC_CONST */
/**@}*/ /* end of ADC register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __ADC_REG_H__ */
